// Generated by jextract

package net.bplo.libs.jimgui.binding;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ImGuiIO {
 *     ImGuiConfigFlags ConfigFlags;
 *     ImGuiBackendFlags BackendFlags;
 *     ImVec2_c DisplaySize;
 *     ImVec2_c DisplayFramebufferScale;
 *     float DeltaTime;
 *     float IniSavingRate;
 *     const char *IniFilename;
 *     const char *LogFilename;
 *     void *UserData;
 *     ImFontAtlas *Fonts;
 *     ImFont *FontDefault;
 *     bool FontAllowUserScaling;
 *     bool ConfigNavSwapGamepadButtons;
 *     bool ConfigNavMoveSetMousePos;
 *     bool ConfigNavCaptureKeyboard;
 *     bool ConfigNavEscapeClearFocusItem;
 *     bool ConfigNavEscapeClearFocusWindow;
 *     bool ConfigNavCursorVisibleAuto;
 *     bool ConfigNavCursorVisibleAlways;
 *     bool MouseDrawCursor;
 *     bool ConfigMacOSXBehaviors;
 *     bool ConfigInputTrickleEventQueue;
 *     bool ConfigInputTextCursorBlink;
 *     bool ConfigInputTextEnterKeepActive;
 *     bool ConfigDragClickToInputText;
 *     bool ConfigWindowsResizeFromEdges;
 *     bool ConfigWindowsMoveFromTitleBarOnly;
 *     bool ConfigWindowsCopyContentsWithCtrlC;
 *     bool ConfigScrollbarScrollByPage;
 *     float ConfigMemoryCompactTimer;

 *     ImGuiContext *Ctx;
 *     ImVec2_c MousePos;
 *     bool MouseDown[5];
 *     float MouseWheel;
 *     float MouseWheelH;
 *     ImGuiMouseSource MouseSource;
 *     bool KeyCtrl;
 *     bool KeyShift;
 *     bool KeyAlt;
 *     bool KeySuper;
 *     ImGuiKeyChord KeyMods;
 *     ImGuiKeyData KeysData[155];
 *     bool WantCaptureMouseUnlessPopupClose;
 *     ImVec2_c MousePosPrev;
 *     ImVec2_c MouseClickedPos[5];
 *     double MouseClickedTime[5];
 *     bool MouseClicked[5];
 *     bool MouseDoubleClicked[5];
 *     ImU16 MouseClickedCount[5];
 *     ImU16 MouseClickedLastCount[5];
 *     bool MouseReleased[5];
 *     double MouseReleasedTime[5];
 *     bool MouseDownOwned[5];
 *     bool MouseDownOwnedUnlessPopupClose[5];
 *     bool MouseWheelRequestAxisSwap;
 *     bool MouseCtrlLeftAsRightClick;
 *     float MouseDownDuration[5];
 *     float MouseDownDurationPrev[5];
 *     float MouseDragMaxDistanceSqr[5];
 *     float PenPressure;
 *     bool AppFocusLost;
 *     bool AppAcceptingEvents;
 *     ImWchar16 InputQueueSurrogate;
 *     ImVector_ImWchar InputQueueCharacters;
 * }
 * }
 */
public class ImGuiIO {

    ImGuiIO() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        cimgui_h.C_INT.withName("ConfigFlags"),
        cimgui_h.C_INT.withName("BackendFlags"),
        ImVec2_c.layout().withName("DisplaySize"),
        ImVec2_c.layout().withName("DisplayFramebufferScale"),
        cimgui_h.C_FLOAT.withName("DeltaTime"),
        cimgui_h.C_FLOAT.withName("IniSavingRate"),
        cimgui_h.C_POINTER.withName("IniFilename"),
        cimgui_h.C_POINTER.withName("LogFilename"),
        cimgui_h.C_POINTER.withName("UserData"),
        cimgui_h.C_POINTER.withName("Fonts"),
        cimgui_h.C_POINTER.withName("FontDefault"),
        cimgui_h.C_BOOL.withName("FontAllowUserScaling"),
        cimgui_h.C_BOOL.withName("ConfigNavSwapGamepadButtons"),
        cimgui_h.C_BOOL.withName("ConfigNavMoveSetMousePos"),
        cimgui_h.C_BOOL.withName("ConfigNavCaptureKeyboard"),
        cimgui_h.C_BOOL.withName("ConfigNavEscapeClearFocusItem"),
        cimgui_h.C_BOOL.withName("ConfigNavEscapeClearFocusWindow"),
        cimgui_h.C_BOOL.withName("ConfigNavCursorVisibleAuto"),
        cimgui_h.C_BOOL.withName("ConfigNavCursorVisibleAlways"),
        cimgui_h.C_BOOL.withName("MouseDrawCursor"),
        cimgui_h.C_BOOL.withName("ConfigMacOSXBehaviors"),
        cimgui_h.C_BOOL.withName("ConfigInputTrickleEventQueue"),
        cimgui_h.C_BOOL.withName("ConfigInputTextCursorBlink"),
        cimgui_h.C_BOOL.withName("ConfigInputTextEnterKeepActive"),
        cimgui_h.C_BOOL.withName("ConfigDragClickToInputText"),
        cimgui_h.C_BOOL.withName("ConfigWindowsResizeFromEdges"),
        cimgui_h.C_BOOL.withName("ConfigWindowsMoveFromTitleBarOnly"),
        cimgui_h.C_BOOL.withName("ConfigWindowsCopyContentsWithCtrlC"),
        cimgui_h.C_BOOL.withName("ConfigScrollbarScrollByPage"),
        MemoryLayout.paddingLayout(2),
        cimgui_h.C_FLOAT.withName("ConfigMemoryCompactTimer"),
        cimgui_h.C_FLOAT.withName("MouseDoubleClickTime"),
        cimgui_h.C_FLOAT.withName("MouseDoubleClickMaxDist"),
        cimgui_h.C_FLOAT.withName("MouseDragThreshold"),
        cimgui_h.C_FLOAT.withName("KeyRepeatDelay"),
        cimgui_h.C_FLOAT.withName("KeyRepeatRate"),
        cimgui_h.C_BOOL.withName("ConfigErrorRecovery"),
        cimgui_h.C_BOOL.withName("ConfigErrorRecoveryEnableAssert"),
        cimgui_h.C_BOOL.withName("ConfigErrorRecoveryEnableDebugLog"),
        cimgui_h.C_BOOL.withName("ConfigErrorRecoveryEnableTooltip"),
        cimgui_h.C_BOOL.withName("ConfigDebugIsDebuggerPresent"),
        cimgui_h.C_BOOL.withName("ConfigDebugHighlightIdConflicts"),
        cimgui_h.C_BOOL.withName("ConfigDebugHighlightIdConflictsShowItemPicker"),
        cimgui_h.C_BOOL.withName("ConfigDebugBeginReturnValueOnce"),
        cimgui_h.C_BOOL.withName("ConfigDebugBeginReturnValueLoop"),
        cimgui_h.C_BOOL.withName("ConfigDebugIgnoreFocusLoss"),
        cimgui_h.C_BOOL.withName("ConfigDebugIniSettings"),
        MemoryLayout.paddingLayout(1),
        cimgui_h.C_POINTER.withName("BackendPlatformName"),
        cimgui_h.C_POINTER.withName("BackendRendererName"),
        cimgui_h.C_POINTER.withName("BackendPlatformUserData"),
        cimgui_h.C_POINTER.withName("BackendRendererUserData"),
        cimgui_h.C_POINTER.withName("BackendLanguageUserData"),
        cimgui_h.C_BOOL.withName("WantCaptureMouse"),
        cimgui_h.C_BOOL.withName("WantCaptureKeyboard"),
        cimgui_h.C_BOOL.withName("WantTextInput"),
        cimgui_h.C_BOOL.withName("WantSetMousePos"),
        cimgui_h.C_BOOL.withName("WantSaveIniSettings"),
        cimgui_h.C_BOOL.withName("NavActive"),
        cimgui_h.C_BOOL.withName("NavVisible"),
        MemoryLayout.paddingLayout(1),
        cimgui_h.C_FLOAT.withName("Framerate"),
        cimgui_h.C_INT.withName("MetricsRenderVertices"),
        cimgui_h.C_INT.withName("MetricsRenderIndices"),
        cimgui_h.C_INT.withName("MetricsRenderWindows"),
        cimgui_h.C_INT.withName("MetricsActiveWindows"),
        ImVec2_c.layout().withName("MouseDelta"),
        MemoryLayout.paddingLayout(4),
        cimgui_h.C_POINTER.withName("Ctx"),
        ImVec2_c.layout().withName("MousePos"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_BOOL).withName("MouseDown"),
        MemoryLayout.paddingLayout(3),
        cimgui_h.C_FLOAT.withName("MouseWheel"),
        cimgui_h.C_FLOAT.withName("MouseWheelH"),
        cimgui_h.C_INT.withName("MouseSource"),
        cimgui_h.C_BOOL.withName("KeyCtrl"),
        cimgui_h.C_BOOL.withName("KeyShift"),
        cimgui_h.C_BOOL.withName("KeyAlt"),
        cimgui_h.C_BOOL.withName("KeySuper"),
        cimgui_h.C_INT.withName("KeyMods"),
        MemoryLayout.sequenceLayout(155, ImGuiKeyData.layout()).withName("KeysData"),
        cimgui_h.C_BOOL.withName("WantCaptureMouseUnlessPopupClose"),
        MemoryLayout.paddingLayout(3),
        ImVec2_c.layout().withName("MousePosPrev"),
        MemoryLayout.sequenceLayout(5, ImVec2_c.layout()).withName("MouseClickedPos"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_DOUBLE).withName("MouseClickedTime"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_BOOL).withName("MouseClicked"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_BOOL).withName("MouseDoubleClicked"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_SHORT).withName("MouseClickedCount"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_SHORT).withName("MouseClickedLastCount"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_BOOL).withName("MouseReleased"),
        MemoryLayout.paddingLayout(5),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_DOUBLE).withName("MouseReleasedTime"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_BOOL).withName("MouseDownOwned"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_BOOL).withName("MouseDownOwnedUnlessPopupClose"),
        cimgui_h.C_BOOL.withName("MouseWheelRequestAxisSwap"),
        cimgui_h.C_BOOL.withName("MouseCtrlLeftAsRightClick"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_FLOAT).withName("MouseDownDuration"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_FLOAT).withName("MouseDownDurationPrev"),
        MemoryLayout.sequenceLayout(5, cimgui_h.C_FLOAT).withName("MouseDragMaxDistanceSqr"),
        cimgui_h.C_FLOAT.withName("PenPressure"),
        cimgui_h.C_BOOL.withName("AppFocusLost"),
        cimgui_h.C_BOOL.withName("AppAcceptingEvents"),
        cimgui_h.C_SHORT.withName("InputQueueSurrogate"),
        ImVector_ImWchar.layout().withName("InputQueueCharacters")
